In [7]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sn
%matplotlib inline

In [2]:
jerry=pd.DataFrame({"a":["1","2","3"],"b":["2012-03-20","2015-03-20","2012-01-21"],"c":"jerrito"})

In [3]:
jerry

   a           b        c
0  1  2012-03-20  jerrito
1  2  2015-03-20  jerrito
2  3  2012-01-21  jerrito

In [4]:
jerry.dtypes

a    object
b    object
c    object
dtype: object

In [6]:
jerry["b"]=pd.to_datetime(jerry["b"])

In [7]:
jerry.dtypes

a            object
b    datetime64[ns]
c            object
dtype: object

In [8]:
pd.to_datetime(["2012-03-12","jery"],errors="coerce")

DatetimeIndex(['2012-03-12', 'NaT'], dtype='datetime64[ns]', freq=None)

In [9]:
pd.to_numeric(["3.9","5.8","esd"],errors="coerce")

array([3.9, 5.8, nan])

In [10]:
jeejerry.tail(n=1)

   a          b        c
2  3 2012-01-21  jerrito

In [21]:


#jerry.iloc([1:3,1:3])

In [30]:
F="PS/CSC/19/00"
jj=pd.DataFrame({"index":F,"ID":[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15],"NAME" :(["jerry","selass","naomi","atta","jane","william",
                                                                    
"steven","john","noah","debrah","steven","peter","simon","don","quan"]),
"AGE":[10,14,15,28,15,12,20,14,16,17,18,19,17,19,10] ,
 "COURSE":"Proggramming Technique" })

In [37]:
jj.describe(include="all")

               index         ID    NAME        AGE                  COURSE
count             15  15.000000      15  15.000000                      15
unique             1        NaN      14        NaN                       1
top     PS/CSC/19/00        NaN  steven        NaN  Proggramming Technique
freq              15        NaN       2        NaN                      15
mean             NaN   8.000000     NaN  16.266667                     NaN
std              NaN   4.472136     NaN   4.479583                     NaN
min              NaN   1.000000     NaN  10.000000                     NaN
25%              NaN   4.500000     NaN  14.000000                     NaN
50%              NaN   8.000000     NaN  16.000000                     NaN
75%              NaN  11.500000     NaN  18.500000                     NaN
max              NaN  15.000000     NaN  28.000000                     NaN

In [40]:
jj["AGE"].value_counts()

15    2
14    2
10    2
19    2
17    2
12    1
28    1
20    1
18    1
16    1
Name: AGE, dtype: int64

In [46]:
jj.iloc[3:5,2:4]

   NAME  AGE
3  atta   28
4  jane   15

AttributeError: module 'matplotlib' has no attribute 'plot'